# RbsHvacloadPartitionAreaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsHvacloadPartitionAreaParam Property
ParameterTypeId Class See Also
---
"Partition Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsHvacloadPartitionAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsHvacloadPartitionAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsHvacloadPartitionAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace